app/Controllers/DataKartuKeluargaController.php

SELECT *
FROM `kartu_keluarga`
SELECT COUNT(*) AS `numrows`
FROM `penduduk`
WHERE `id_kk` = '15'
---
    public function index () {
        // Buat Objek dari Class PendudukModel
        $kartu_keluarga = new \App\Models\KartuKeluargaModel();

        // Buat Objek dari Clxass Anggota
        $anggota = new \App\Models\PendudukModel();

        // Ambil semua data yang ada pada table penduduk
        $getData = $kartu_keluarga->findAll();

        $result = [];
        foreach($getData as $item) {
            $countAnggota = $anggota->where("id_kk", $item['id_kk'])->countAllResults();