app/Controllers/DataPendudukController.php

    public function index()
    {
        $penduduk = $db->table('penduduk');

        // Ambil semua data yang ada pada table penduduk

        $query=$penduduk->select('*')
        ->join('kartu_keluarga', 'kartu_keluarga.id_kk = penduduk.id_kk', "left")
        ->orderBy('kartu_keluarga.id_kk', "asc")
        ->get();
---
SELECT *
FROM `penduduk`
LEFT JOIN `kartu_keluarga` ON `kartu_keluarga`.`id_kk` = `penduduk`.`id_kk`
ORDER BY `kartu_keluarga`.`id_kk` ASC

    public function tambah(){
        // untuk mengambil data id
        $kk = new \App\Models\KartuKeluargaModel();

        $getData = $kk->findAll();
---
SELECT *
FROM `kartu_keluarga`

    public function edit_penduduk() {
        $id = $this->request->getGet('id');

        // untuk mengambil data id
        $penduduk = new \App\Models\PendudukModel();

        $getData = $penduduk->find($id);
---
SELECT *
FROM `penduduk`
WHERE `penduduk`.`id` = '228'

            "type" => ""
        ];

        $update = $penduduk->update($id, $data);
---
UPDATE `penduduk` SET `nama` = 'Uki Mulyadi', `jenis_kelamin` = 'L', `tempat_lahir` = 'Bogor', `tanggal_lahir` = '1947-06-15', `agama` = 'Islam', `pendidikan` = 'SD', `pekerjaan` = 'Buruh', `penghasilan` = '<500K', `pengeluaran` = '<500K', `sumber_air` = 'Sumur Milik Sendiri', `status_kawin` = 'Belum Kawin', `status_rumah` = 'Kontrak', `daya_listrik` = 'Listrik 450 Watt', `transportasi` = 'Sepeda Motor 1 Buah dalam Kondisi Baik', `is_kepala_keluarga` = '1'
WHERE `penduduk`.`id` IN ('228')