app/Controllers/PeriodeBansosController.php

SELECT *
FROM `periode_bansos`
---
    public function index()
    {
        // Buat Objek dari Class PendudukModel
        $periodeBansos = new \App\Models\PeriodeBansosModel();

        // Ambil semua data yang ada pada table penduduk
        $getData = $periodeBansos->findAll();